{
  "1.1": {
    "titulo": "**Descomposición de Series Temporales de Precios:** \n   ",
    "descripcion": "**Descomposición de Series Temporales de Precios:** \n   ",
    "contenido": "**Uso de Datos:** Usa la columna `AveragePrice` y `Date`.\n   - **Esperado:** Utiliza la función `seasonal_decompose` de la librería `statsmodels` para descomponer la serie temporal de precios en componentes de tendencia, estacionalidad y ruido. \n     - Convierte `Date` a tipo datetime usando `pd.to_datetime()`.\n     - Agrupa los datos por `Date` y calcula el promedio de `AveragePrice` utilizando `groupby()` si es necesario.\n     - Visualiza los componentes descompuestos usando `matplotlib` para cada uno de ellos.",
    "explicacion": "** He agrupado por fecha y calculado el promedio de AveragePrice para cada fecha. Luego he descompuesto la serie temporal en componentes de tendencia, estacionalidad y residuos. \n\nLa tendencia muestra la evolución general de los precios a lo largo del tiempo, la estacionalidad refleja patrones recurrentes en los precios y los residuos representan la variabilidad no explicada por la tendencia y la estacionalidad. \n\nEste análisis ayuda a identificar patrones y tendencias en los precios de los aguacates, lo que puede ser útil para predecir futuros precios o entender la dinámica del mercado."
  },
  "1.2": {
    "titulo": "**Análisis de Estacionalidad por Región:** ",
    "descripcion": "**Análisis de Estacionalidad por Región:** \n   ",
    "contenido": "**Análisis de Estacionalidad por Región:** \n   - **Uso de Datos:** Usa las columnas `AveragePrice`, `Date` y `Total Volume`.\n   - **Esperado:** Utiliza gráficos de líneas para visualizar cómo varían los precios de aguacates por región a lo largo de diferentes estaciones del año.\n     - Agrupa los datos por `region` y `Date` utilizando `groupby()`.\n     - Calcula el promedio de `AveragePrice` para cada región.\n     - Representa gráficamente las tendencias utilizando `plt.plot()` de `matplotlib`.",
    "explicacion": "- **Cada línea representa una región específica y permite observar las tendencias estacionales en los precios. \n - **Por ejemplo, se pueden identificar picos o caídas en precios en ciertas épocas, lo que refleja la oferta y demanda."
  },
  "1.3": {
    "titulo": "**Comparación de Precios Promedio Mensuales:**",
    "descripcion": "**Comparación de Precios Promedio Mensuales:** \n   ",
    "contenido": "**Uso de Datos:** Usa las columnas `AveragePrice` y `Date`.\n   - **Esperado:** Calcula y compara los precios promedio mensuales.\n     - Agrupa los datos por mes usando `pd.Grouper` con `freq='M'`.\n     - Calcula el promedio de `AveragePrice` para cada mes con `mean()`.\n     - Visualiza los resultados con un gráfico de líneas usando `plt.plot()`.",
    "explicacion": "**Grafica agrupada por mes usando Grouper que te da la opcion de agrupar por el mes, el año, el dia, etc.** \n**Calcula el promedio de AveragePrice para cada mes con mean()** \n**Visualiza los resultados con un gráfico de líneas usando plt.plot()**"
  },
  "1.4": {
    "titulo": "**Tendencia de Ventas a lo Largo del Tiempo:**",
    "descripcion": "**Tendencia de Ventas a lo Largo del Tiempo:** \n   ",
    "contenido": "- **Uso de Datos:** Usa las columnas `Total Volume` y `Date`.\n   - **Esperado:** Analiza cómo varía el volumen total de ventas a lo largo del tiempo.\n     - Agrupa los datos por `Date` y suma el `Total Volume` usando `groupby()`.\n     - Visualiza los resultados usando un gráfico de líneas con `plt.plot()` para mostrar la tendencia.",
    "explicacion": ""
  },
  "1.5": {
    "titulo": "**Análisis de Cambios en Precios Anuales:**",
    "descripcion": "**Análisis de Cambios en Precios Anuales:** \n   ",
    "contenido": "**Análisis de Cambios en Precios Anuales:**\n   - **Uso de Datos:** Usa las columnas `AveragePrice` y `year`.\n   - **Esperado:** Observa las diferencias anuales en los precios promedio.\n     - Agrupa los datos por `year` utilizando `groupby()`.\n     - Calcula el promedio de `AveragePrice` para cada año.\n     - Representa los resultados en un gráfico de barras usando `plt.bar()` que compare los precios de cada año.",
    "explicacion": "- He quitado el año 2018 ya que no tenemos el año completo y no seria una evaluación real de los datos.** \n- He agrupado los datos por año y calculado el promedio de AveragePrice para cada año. \n - He representado los resultados en un gráfico de barras para comparar los precios de cada año. -- Vemos un incremento del precio medio de los aguacates en 2017 respecto a 2015 y 2016. \n - Añadiendo la linea plt.xticks convertirmos los años en enteros evitando que se muestren en notación científica."
  },
  "2.1": {
    "titulo": "**Gráfico de Violín de Volumen de Ventas por Región:**",
    "descripcion": "**Gráfico de Violín de Volumen de Ventas por Región:** \n   ",
    "contenido": "- **Uso de Datos:** Usa las columnas `Total Volume` y `region`.\n   - **Esperado:** Visualiza la distribución de ventas en diferentes regiones.\n     - Utiliza la función `violinplot` de `seaborn` para crear gráficos de violín.\n     - Configura los ejes para mostrar la relación entre `Total Volume` y `region`.\n     - Añade etiquetas y títulos usando `plt.title()` y `plt.xlabel()` para facilitar la interpretación.",
    "explicacion": "- Cada violín indica **la densidad de la distribución** del volumen de ventas de cada región.\n - La forma y el ancho del violín a lo largo del eje Y representan cuántas observaciones están dentro de ese rango de Total Volume para la región dada. Un violín más ancho en un área específica significa más datos en ese rango de ventas. \n - En cada violín puedes ver una línea central que marca la mediana, y a veces otras líneas para los cuartiles, dependiendo de la configuración predeterminada."
  },
  "2.2": {
    "titulo": "**Boxplot Comparativo de Precios entre Años:**",
    "descripcion": "**Boxplot Comparativo de Precios entre Años:** \n   ",
    "contenido": "- **Uso de Datos:** Usa las columnas `AveragePrice` y `year`.\n   - **Esperado:** Genera boxplots para comparar la distribución de precios.\n     - Utiliza `boxplot` de `seaborn` para crear boxplots que comparen `AveragePrice` entre diferentes años.\n     - Asegúrate de que cada boxplot represente un año diferente.\n     - Incluye etiquetas y títulos descriptivos usando `plt.title()`.",
    "explicacion": ""
  },
  "2.3": {
    "titulo": "**Histograma de Volumen Total de Ventas:**",
    "descripcion": "**Histograma de Volumen Total de Ventas:** \n   ",
    "contenido": " - **Uso de Datos:** Usa la columna `Total Volume`.\n   - **Esperado:** Crea un histograma para mostrar la distribución del volumen total de ventas.\n     - Utiliza `hist()` de `matplotlib` para crear el histograma.\n     - Ajusta el número de bins para una visualización clara usando el parámetro `bins`.\n     - Añade etiquetas y un título que describa lo que se muestra.",
    "explicacion": "**bins**  \n**int o secuencia, predeterminado 10**  \nNúmero de *bins* (intervalos) para el histograma. Si se proporciona un número entero, se calculan y devuelven los bordes de los bins como `bins + 1`. Si se proporciona una secuencia, se especifican los bordes de los bins, incluyendo el borde izquierdo del primer bin y el borde derecho del último bin. En este caso, se devuelve `bins` sin modificar."
  },
  "2.4": {
    "titulo": "**Gráfico de Barras de Ventas por Tipo de Bolsa:**",
    "descripcion": "**Gráfico de Barras de Ventas por Tipo de Bolsa:** \n   ",
    "contenido": "- **Uso de Datos:** Utiliza las columnas `Total Bags`, `Small Bags`, `Large Bags` y `XLarge Bags`.\n   - **Esperado:** Compara las ventas de diferentes tipos de bolsas.\n     - Suma los volúmenes de ventas por tipo de bolsa utilizando `sum()`.\n     - Crea un gráfico de barras con `plt.bar()` para mostrar las diferencias en ventas.\n     - Asegúrate de incluir etiquetas para cada tipo de bolsa.",
    "explicacion": ""
  },
  "2.5": {
    "titulo": "**Gráfico de Líneas de Precios Promedios por Año:**",
    "descripcion": "**Gráfico de Líneas de Precios Promedios por Año:** \n   ",
    "contenido": "- **Uso de Datos:** Utiliza las columnas `AveragePrice` y `year`.\n   - **Esperado:** Visualiza la tendencia de precios promedio a lo largo de los años.\n     - Agrupa los datos por `year` y calcula el promedio de `AveragePrice`.\n     - Usa `plt.plot()` para crear un gráfico de líneas que muestre la evolución de precios.\n     - Añade un título y etiquetas descriptivas a los ejes usando `plt.title()` y `plt.xlabel()`.",
    "explicacion": ""
  },
  "3.1": {
    "titulo": "**Elasticidad Precio-Demanda por Año:**",
    "descripcion": "**Elasticidad Precio-Demanda por Año:** \n   ",
    "contenido": "- **Uso de Datos:** Usa las columnas `AveragePrice` y `Total Volume`.\n   - **Esperado:** Calcula la elasticidad del precio de la demanda para cada año.\n  - Calcula la variación porcentual de `Total Volume` y `AveragePrice` utilizando `pd.pct_change()`.\n     - Utiliza la fórmula de elasticidad para determinar la sensibilidad de la demanda respecto al precio.\n     - Presenta los resultados en un gráfico de líneas usando `plt.plot()` para mostrar la elasticidad por año.",
    "explicacion": "- **Cálculos de variación porcentual:** - Usamos .pct_change() para calcular la variación porcentual en Total Volume y AveragePrice de un año a otro.\n - **Elasticidad:** - Se calcula la elasticidad como la razón de la variación porcentual del volumen sobre la variación porcentual del precio.\n - **Filtrado** de los datos: Se filtran los datos entre 2014 y 2017 usando chart.filterByRangeYear (asumí que esta función está correctamente definida en tu código).\n - **Gráfico de líneas:** - Usamos plt.plot() para trazar la elasticidad a lo largo de los años y añadir etiquetas y una leyenda."
  },
  "3.2": {
    "titulo": "**Comparación de Elasticidad en Diferentes Mercados:**",
    "descripcion": "**Comparación de Elasticidad en Diferentes Mercados:** \n   ",
    "contenido": "- **Uso de Datos:** Utiliza las columnas `Total Volume` y `AveragePrice`.\n   - **Esperado:** Calcula la elasticidad del precio de la demanda en diferentes regiones.\n     - Agrupa los datos por `region` y calcula la elasticidad para cada región utilizando `pd.pct_change()`.\n     - Presenta un gráfico de barras que muestre la elasticidad por región usando `plt.bar()`.",
    "explicacion": ""
  },
  "3.3": {
    "titulo": "**Elasticidad a Nivel de Tipo de Bolsa:**",
    "descripcion": "**Elasticidad a Nivel de Tipo de Bolsa:** \n   ",
    "contenido": "- **Uso de Datos:** Usa las columnas `AveragePrice` y `Total Bags`.\n   - **Esperado:** Calcula la elasticidad del precio de la demanda específica para cada tipo de bolsa.\n     - Suma los volúmenes de ventas por tipo de bolsa utilizando `groupby()` y `sum()`.\n     - Calcula la elasticidad para cada tipo y presenta los resultados en un gráfico comparativo usando `plt.bar()`.",
    "explicacion": "\n El valor -0.2 ajusta la posición de las barras en el eje X. Esto es especialmente útil cuando quieres mostrar varias barras agrupadas por año (o cualquier otra categoría en el eje X) y evitar que se superpongan. \n - df_group3_3['year'] - 0.2 para una barra,\n - df_group3_3['year'] para otra,\n - df_group3_3['year'] + 0.2 para la siguiente, y así sucesivamente.\n **Comentarios:**\n - a) Para calcular la elasticidad del precio de la demanda específica de cada tipo de bolsa (Small Bags, Large Bags, XLarge Bags) \n  en base al archivo CSV adjunto, haremos lo siguiente:\n - b) Agruparemos y sumaremos los volúmenes de ventas por cada tipo de bolsa.\n - c) Calcularemos la variación porcentual de AveragePrice y de cada tipo de bolsa por año usando pct_change.\n - d) Calcularemos la elasticidad para cada tipo de bolsa dividiendo la variación porcentual de ventas por la variación porcentual del precio.\n e) Visualizaremos los resultados en un gráfico de barras para comparar las elasticidades entre los tipos de bolsa."
  },
  "3.4": {
    "titulo": "**Análisis de Elasticidad Comparativa entre Orgánicos y Convencionales:**",
    "descripcion": "**Análisis de Elasticidad Comparativa entre Orgánicos y Convencionales:** \n   ",
    "contenido": "- **Uso de Datos:** Usa las columnas `AveragePrice`, `Total Volume` y `type`.\n   - **Esperado:** Compara la elasticidad de la demanda entre aguacates orgánicos y convencionales.\n     - Agrupa los datos por `type` y calcula la elasticidad utilizando `pd.pct_change()`.\n     - Presenta un gráfico que muestre la diferencia en elasticidad entre los dos tipos usando `plt.bar()`.",
    "explicacion": ""
  },
  "3.5": {
    "titulo": "**Análisis de la Elasticidad Precios-Ventas:**",
    "descripcion": "**Análisis de la Elasticidad Precios-Ventas:** \n   ",
    "contenido": "- **Uso de Datos:** Usa las columnas `AveragePrice` y `Total Volume`.\n   - **Esperado:** Examina cómo las variaciones en `AveragePrice` afectan a `Total Volume`.\n     - Realiza un análisis de la relación entre estas dos variables calculando la elasticidad.\n     - Presenta un gráfico de dispersión que muestre la relación y discute la tendencia observada utilizando `plt.scatter()` y `plt.plot()`.",
    "explicacion": " Refleja un valor constante de 1.0 para todos los años. Esto sugiere que la **elasticidad es uniforme** en todos los años y está fijada en 1.0, lo que implica que el cambio porcentual en el volumen de ventas es exactamente proporcional al cambio porcentual en el precio promedio (es decir, un cambio del 1% en el precio se refleja en un cambio del 1% en el volumen de ventas)."
  },
  "4.1": {
    "titulo": "**Cohortes Basadas en Precios Promedios Trimestrales:**",
    "descripcion": "**Cohortes Basadas en Precios Promedios Trimestrales:** \n   ",
    "contenido": "- **Uso de Datos:** Usa las columnas `AveragePrice`, `Total Volume` y `Date`.\n   - **Esperado:** Crea cohortes trimestrales y analiza cambios en precios y volúmenes.\n     - Agrupa los datos por trimestre usando `pd.Grouper` con `freq='Q'`.\n     - Calcula el promedio de `AveragePrice` y suma `Total Volume` para cada cohorte.\n     - Visualiza los resultados en un gráfico de líneas que muestre la evolución de las cohortes.",
    "explicacion": ""
  },
  "4.2": {
    "titulo": "**Cohortes por Región y Fecha:**",
    "descripcion": "**Cohortes por Región y Fecha:** \n   ",
    "contenido": " - **Uso de Datos:** Utiliza las columnas `AveragePrice`, `Total Volume`, `region` y `Date`.\n   - **Esperado:** Analiza cómo varían las cohortes de diferentes regiones.\n     - Agrupa los datos por `region` y `Date` usando `groupby()`.\n     - Calcula el promedio de precios y volumen para cada cohorte.\n     - Presenta los resultados en gráficos de barras que muestren comparaciones entre regiones.",
    "explicacion": "** Interpretación del Gráfico** \n - El gráfico muestra la evolución de AveragePrice y Total Volume para cada región a lo largo del tiempo. \n** Las barras representan el volumen total y las líneas indican el precio promedio en cada trimestre, lo que ayuda a comparar \n** cómo las diferentes regiones responden a cambios en el mercado."
  },
  "4.3": {
    "titulo": "**Análisis de Cohortes en Función del Tipo de Bolsa:**",
    "descripcion": "**Cohortes por Región y Fecha:** \n   ",
    "contenido": "- **Uso de Datos:** Usa las columnas `Total Bags`, `Small Bags`, `Large Bags`, `XLarge Bags` y `Date`.\n   - **Esperado:** Examina cómo se comportan las diferentes cohortes según el tipo de bolsa.\n     - Agrupa los datos por tipo de bolsa y `Date`.\n     - Calcula el volumen de ventas total y muestra los resultados en un gráfico de líneas.",
    "explicacion": ""
  },
  "4.4": {
    "titulo": "**Cohortes de Clientes Basadas en Ventas:**",
    "descripcion": "**Cohortes por Región y Fecha:** \n   ",
    "contenido": "- **Uso de Datos:** Usa las columnas `Total Volume`, `Date` y `region`.\n   - **Esperado:** Analiza el comportamiento de las cohortes según el volumen de ventas.\n     - Clasifica los clientes según su volumen de compras.\n     - Visualiza las cohortes en gráficos de líneas o barras que muestren el comportamiento de compra a lo largo del tiempo.",
    "explicacion": "\n Este código analiza el volumen de ventas por región y clasifica las regiones en cohortes (Baja, Media y Alta) basadas en el promedio de sus ventas.\n - Después, genera una **gráfica de líneas que muestra cómo varía el volumen de ventas de cada cohorte a lo largo del tiempo**.\n\n **Agrupación de datos:**\n - Primero, agrupamos los datos por Date (fecha) y region para calcular el volumen total de ventas para cada combinación de estas dos variables.\n  - Esto nos permite tener un total de ventas por región y por fecha.\n\n **Clasificación en cohortes:**\n\n - Calculamos el volumen promedio de ventas para cada región y, usando los cuartiles, clasificamos estas regiones en tres cohortes: Baja, Media y Alta.\n - Cada región se clasifica en una cohorte dependiendo de su volumen de ventas promedio, y esta información se agrega a nuestro DataFrame principal.\n\n **Creación de la gráfica:**\n\n**Configuramos el título y los ejes de la gráfica.**\n - **Para cada cohorte, generamos una serie de datos que representa el total de ventas por fecha** y lo graficamos en líneas.\n - Esta visualización muestra la tendencia de ventas de cada cohorte en el tiempo, lo que puede ayudar a identificar patrones de comportamiento en los distintos grupos de clientes.\n\n\n **Conclusión**: Este análisis clasifica a las regiones en tres grupos (Baja, Media y Alta) según el volumen de ventas. Esto nos permite ver cómo cada grupo se comporta en el tiempo.\n\n - Las regiones de la cohorte Alta muestran ventas más estables y mayores, indicando un mercado sólido.\n - Las cohortes Baja y Media tienen menos ventas y más variación, lo que podría señalar oportunidades de crecimiento."
  },
  "4.5": {
    "titulo": "**Evaluación de Retención de Ventas por Cohorte:**",
    "descripcion": "**Cohortes por Región y Fecha:** \n   ",
    "contenido": "- **Uso de Datos:** Usa las columnas `Total Volume` y `Date`.\n   - **Esperado:** Estudia cómo se retienen las ventas en cohortes a lo largo de un año.\n     - Agrupa los datos por mes y cohortes.\n     - Calcula la retención de ventas y visualiza los resultados en un gráfico de líneas que muestre las tasas de retención.",
    "explicacion": "**Explicación del Código**\n Agrupación Mensual: Agrupamos el volumen de ventas a nivel mensual.\n** Identificación de Cohortes: Cada mes se marca como el inicio de una nueva cohorte.\n** Cálculo de Retención: Para cada cohorte inicial, calculamos la tasa de retención mensual dividiendo el volumen de ventas en meses subsiguientes \n** por el volumen inicial.\n** Visualización: Creamos un gráfico de líneas en el que cada cohorte tiene su propia línea, mostrando la tasa de retención a lo largo de los meses.\n** Interpretación del Gráfico\n** Este gráfico mostrará cómo las ventas se retienen o disminuyen mes a mes para cada cohorte. Las tendencias ayudan a evaluar \n** la estabilidad de las ventas en el tiempo."
  },
  "5.1": {
    "titulo": "**Matriz de Correlación:** ",
    "descripcion": "",
    "contenido": "- **Uso de Datos:** Utiliza las columnas numéricas del DataFrame (p. ej., `AveragePrice`, `Total Volume`, `4046`, `4225`, `4770`, `Total Bags`).\n   - **Esperado:** \n     - Importa las librerías necesarias: `import seaborn as sns` y `import matplotlib.pyplot as plt`.\n     - Calcula la matriz de correlación usando el método `.corr()` del DataFrame.\n     - Visualiza la matriz utilizando `sns.heatmap()`. \n     - Anota las correlaciones más significativas y discute su posible impacto en el análisis.",
    "explicacion": "** Interpretación de la Matriz de Correlación\n** Una vez que ejecutes el gráfico, observa los siguientes puntos para evaluar el impacto de cada relación:\n\n** Relación de AveragePrice con Volumen de Ventas (Total Volume): Una correlación negativa significativa aquí podría indicar una elasticidad \n** en la demanda: al aumentar el precio promedio, el volumen de ventas disminuye, lo que es esperado en productos elásticos.\n** Relación entre Tipos de Aguacate (4046, 4225, 4770) y Total Volume: Correlaciones altas entre estos tipos y el volumen total indicarán que \n** los distintos tipos de aguacates contribuyen significativamente al volumen total.\n** Correlación entre Total Bags y Volumen de Ventas: Esta relación podría mostrar qué tipos de empaques afectan \n** las ventas y cómo varían con el volumen general.\n** Discusión\n** Este análisis ayuda a identificar cómo las variables se relacionan entre sí y nos da información clave para entender patrones de ventas \n** y precios en el mercado de aguacates. Las correlaciones más fuertes podrán indicar relaciones directas o indirectas entre \n** las variables y sugieren áreas en las que un cambio en una variable puede afectar a otra."
  },
  "5.2": {
    "titulo": "**Análisis de Dispersión entre Variables Clave:** ",
    "descripcion": "",
    "contenido": "- **Uso de Datos:** Selecciona variables numéricas de interés como `AveragePrice` y `Total Volume`.\n   - **Esperado:** \n     - Importa las librerías necesarias: `import seaborn as sns` y `import matplotlib.pyplot as plt`.\n     - Crea un gráfico de dispersión con `sns.scatterplot()` para visualizar la relación entre `AveragePrice` y `Total Volume`.\n     - Añade una línea de regresión utilizando `sns.regplot()` para ilustrar las tendencias.\n     - Compara el ajuste de una regresión lineal frente a una polinómica.",
    "explicacion": ""
  },
  "5.3": {
    "titulo": "**Predicciones Mensuales Usando Datos Trimestrales:**",
    "descripcion": "",
    "contenido": "- **Uso de Datos:** Agrupa datos por trimestres y segmenta en meses utilizando `Date`, `AveragePrice`, y `Total Volume`.\n   - **Esperado:** \n     - Convierte la columna `Date` a tipo datetime si es necesario.\n     - Agrupa los datos por trimestre y calcula el promedio de `AveragePrice` y `Total Volume`.\n     - Utiliza los datos de los primeros 2 meses de un trimestre para predecir el precio del tercer mes.\n     - Compara los resultados de las predicciones con los precios reales.\n     - Evalúa la precisión de tus predicciones utilizando métricas como R² y RMSE.",
    "explicacion": ""
  },
  "5.4": {
    "titulo": "**Predicciones Trimestrales:**",
    "descripcion": "",
    "contenido": "- **Uso de Datos:** Agrupa los datos en trimestres usando solo variables numéricas.\n   - **Esperado:** \n     - Agrupa los datos por trimestres usando `pd.Grouper()` con `freq='Q'` para obtener promedios.\n     - Usa los datos de 1 o 2 trimestres anteriores para predecir el siguiente trimestre ajustando modelos de regresión lineal y polinómica.\n     - Compara los resultados de las predicciones con los precios reales.\n     - Evalúa la precisión de tus predicciones utilizando métricas como R² y RMSE.",
    "explicacion": ""
  },
  "5.5": {
    "titulo": "**Predicciones Anuales:**",
    "descripcion": "",
    "contenido": "- **Uso de Datos:** Agrupa los datos en años, utilizando únicamente columnas numéricas.\n   - **Esperado:** \n     - Agrupa los datos por año utilizando `pd.Grouper()` con `freq='Y'`.\n     - Usa los datos de 1 o 2 años anteriores para predecir el siguiente año ajustando modelos de regresión lineal y polinómica.\n     - Evalúa la precisión de tus predicciones utilizando métricas como R² y RMSE.",
    "explicacion": ""
  },
  "5.6": {
    "titulo": "**Desarrollo de Modelos de Regresión Múltiple:** ",
    "descripcion": "",
    "contenido": "- **Uso de Datos:** Selecciona varias variables numéricas como `Total Volume`, `4046`, `4225`, `4770`, y `Total Bags` para predecir `AveragePrice`.\n   - **Esperado:** \n     - Define las variables independientes (X) y dependientes (y).\n     - Ajusta modelos de regresión múltiple.\n     - Compara su rendimiento utilizando métricas como R² y RMSE y discute las implicaciones de los resultados.",
    "explicacion": ""
  },
  "5.7": {
    "titulo": "**Análisis de Coeficientes de Regresión Múltiple:**",
    "descripcion": "",
    "contenido": "- **Uso de Datos:** Examina los coeficientes de los modelos de regresión múltiple ajustados.\n   - **Esperado:** \n     - Extrae los coeficientes del modelo ajustado.\n     - Interpreta los coeficientes para entender el impacto de cada variable numérica en `AveragePrice`.\n     - Comenta sobre las variables más significativas y su relevancia.",
    "explicacion": ""
  },
  "5.8": {
    "titulo": "**Modelos de Regresión para Diferenciar Volúmenes de Ventas:**",
    "descripcion": "",
    "contenido": "- **Uso de Datos:** Usa `AveragePrice`, `Total Volume`, `4046`, `4225`, y `4770`.\n   - **Esperado:** \n     - Ajusta modelos de regresión para analizar cómo los diferentes volúmenes de ventas afectan `AveragePrice`.\n     - Compara los resultados de regresión lineal y polinómica.\n     - Presenta las conclusiones de tus análisis.",
    "explicacion": ""
  },
  "5.9": {
    "titulo": "**Análisis de la Influencia de las Ventas Totales en el Precio Promedio:**",
    "descripcion": "",
    "contenido": "- **Uso de Datos:** Usa `Total Volume`, `AveragePrice`, y `Total Bags`.\n   - **Esperado:** \n     - Ajusta un modelo de regresión lineal y polinómica para ver cómo varía `AveragePrice` en función del volumen total de ventas.\n     - Evalúa la significancia de los coeficientes y discute su relevancia.",
    "explicacion": ""
  },
  "5.10": {
    "titulo": "**Regresión para Predecir el Precio Promedio Según el Volumen de Aguacates por Tipo:**",
    "descripcion": "",
    "contenido": "- **Uso de Datos:** Usa `AveragePrice`, `4046`, `4225`, `4770`, y `Total Volume`.\n    - **Esperado:** \n      - Ajusta modelos de regresión lineal y polinómica.\n      - Evalúa la efectividad de ambos modelos utilizando métricas como R² y RMSE.\n      - Discute cuál modelo ofrece mejores predicciones y por qué, basándote en los resultados obtenidos.",
    "explicacion": ""
  }
}
